import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'
import { Table, TableWrapper, Row, Rows, Col } from 'react-native-table-component';

const CONTENT = {
    tableHead: ['ประเภทกิจกรรม 1 ชั่วโมง', 'การเผาผลาญ (กิโลแคลอรี่)'],
    tableData: [
      ['กรรเชียงเรือด้วยความเร็ว 17.6กม./ชม.', '970 กิโลแคลอรี่'],
      ['กรรเชียงเรือด้วยความเร็ว 5.6กม./ชม.', '660 กิโลแคลอรี่'],
      ['กระโดดเชือก', '780 กิโลแคลอรี่'],
      ['ขี่จักรยานด้วยความเร็ว 20.0กม./ชม.', '660 กิโลแคลอรี่'],
      ['ขี่จักรยานด้วยความเร็ว 14.4กม./ชม.', '415 กิโลแคลอรี่'],
      ['ขี่จักรยาน', '250-600 กิโลแคลอรี่'],
      ['กวาดพื้น', '225 กิโลแคลอรี่'],
      ['การเต้น Zumba', '500 กิโลแคลอรี่'],
      ['ซักผ้าด้วยมือ', '240 กิโลแคลอรี่'],
      ['ตัดหญ้า', '250-300 กิโลแคลอรี่'],
      ['ตีกอล์ฟ ลากถุงกอล์ฟ', '300 กิโลแคลอรี่'],
      ['ทำงานบ้าน', '150-250 กิโลแคลอรี่'],
      ['ทำสวน', '300-450 กิโลแคลอรี่'],
      ['นั่งดูทีวี', '100 กิโลแคลอรี่'],
      ['นั่งทำงานใช้สมอง', '110 กิโลแคลอรี่'],
      ['นอนหลับ', '75 กิโลแคลอรี่'],
      ['บาสเก็ตบอล', '360-660 กิโลแคลอรี่'],
      ['ปูที่นอน', '135 กิโลแคลอรี่'],
      ['มวยไทย', '800 กิโลแคลอรี่'],
      ['ยืน', '150 กิโลแคลอรี่'],
      ['วิ่งบนทางราบด้วยความเร็ว 12.8กม./ชม.', '825 กิโลแคลอรี่'],
      ['วิ่งเร็ว', '900-1,200 กิโลแคลอรี่'],
      ['วิ่งเหยาะๆ', '600-750 กิโลแคลอรี่'],
      ['ว่ายน้ำ', '260-750 กิโลแคลอรี่'],
      ['ว่ายน้ำด้วยความเร็ว 3.00กม./ชม.', '850 กิโลแคลอรี่'],
      ['รีดผ้า', '150 กิโลแคลอรี่'],
      ['เดินขึ้นบันได', '600-1,080 กิโลแคลอรี่'],
      ['เดินขึ้นเนิน', '480-900 กิโลแคลอรี่'],
      ['เดินธรรมดา', '300 กิโลแคลอรี่'],
      ['เล่นวอลเล่ย์บอล', '300 กิโลแคลอรี่'],
      ['เล่นสเก็ตปกติ', '420 กิโลแคลอรี่'],
      ['เล่นสเก็ตแข่งความเร็ว', '700 กิโลแคลอรี่'],
      ['เล่นฮูล่าฮูป', '430 กิโลแคลอรี่'],
      ['เล่นเทนนิสคู่', '360 กิโลแคลอรี่'],
      ['เล่นเทนนิสเดี่ยว', '480 กิโลแคลอรี่'],
      ['เล่นแบดมินตัน', '350 กิโลแคลอรี่'],
      ['เล่นโบว์ลิ่ง', '400 กิโลแคลอรี่'],
      ['แอโรบิค', '600 กิโลแคลอรี่'],
      ['ออกกำลังกายแบบ HIT', '700-800 กิโลแคลอรี่'],
    ],
  };
export default function Activity() {
  return (
    <View style={{flex:1}}>
    <ScrollView>
      <View style={{paddingHorizontal:15,paddingTop:15,paddingBottom:15}}>
        <Text style={{fontFamily:'notos',textAlign:'center',fontSize:16}}>กิจกรรมการเผาผลาญแคลอรี่</Text>
        <Text style={{fontFamily:'noto'}}>การออกกำลังกาย 30-45 นาที และ 3-5 วันต่อสัปดาห์</Text>
        <View style={{paddingTop:10}} />
        <Table borderStyle={{ borderWidth: 1 }}>
        <Row
          data={CONTENT.tableHead}
          flexArr={[ 1.3, 1]}
          style={styles.head}
          textStyle={styles.text}
        />
        <TableWrapper style={styles.wrapper}>
          
          <Rows
            data={CONTENT.tableData}
            flexArr={[ 1.3, ,1]}
            style={styles.row}
            textStyle={{paddingLeft:10,fontFamily:'noto'}}
          />
        </TableWrapper>
      </Table>
        </View>
        </ScrollView>
    </View>
  )
}

const styles = StyleSheet.create({
    container: { flex: 1, backgroundColor: '#fff' },
    head: {   },
    wrapper: { flexDirection: 'row' },
    row: {  },
    text: { textAlign: 'center',fontFamily:'noto' },
  });