import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

export default function Emotional() {
  return (
    <View style={{flex:1}}>
    <ScrollView>
      <View style={{paddingHorizontal:15,paddingTop:15,paddingBottom:15}}>
        <Text style={{fontFamily:'notos'}}>พฤติกรรมด้านอารมณ์</Text>
        <Text style={{fontFamily:'noto'}}>          คอร์ติซอล (Cortisol) จะเกิดการหลั่งของฮอร์โมนที่ตอบสนองต่อความเครียด เพราะร่างกายเข้าใจว่าในภาวะเครียดต้องการพลังงานจำนวนมากเพื่อประทังชีวิต ภาวะที่ตึงเครียด ซึ่งส่งผลเสียกับร่างกายหลายด้าน โดยในส่วนที่เกี่ยวข้องกับน้ำหนักตัวมี ดังนี้</Text>
        <Text style={{fontFamily:'noto'}}>          1. เกิดความหิวง่ายกว่าปกติ โดยเฉพาะอาหารประเภทคาร์โบไฮเดรต หรืออาหารน้ำตาลสูง อาหารแคลอรี่สูง ขนม เช่น ไอศครีม เค้ก และช็อคโกแล็ต จึงเป็นอาหารที่ต้องการนำมารับประทานในยามเครียด เมื่อความเครียดเข้ามาในชีวิต สมองส่วนที่ถูกกระตุ้นเป็นอันดับแรกคือ อะมิกดาลา (Amygdala) ซึ่งจะส่งต่อสัญญาณความเครียดนั้นไปยังสมองส่วนไฮโปธาลามัส (Hypothalamus) ที่พร้อมจะสั่งการให้ระบบประสาทอัตโนมัติซิมพาเธติกทำงาน จึงถูกกระตุ้น ส่งผลให้หัวใจเต้นแรงและเร็ว เพื่อสูบฉีดเลือดไปเลี้ยงอวัยวะสำคัญอย่างสมอง กล้ามเนื้อ และหัวใจ จังหวะในการหายใจเร็วขึ้น เพื่อให้ออกซิเจนถูกลำเลียงเข้าสู่ร่างกายมากขึ้น ระดับน้ำตาลถูกปล่อยออกมาในกระแสเลือดมากขึ้น เพื่อให้สมองพร้อมนำไปใช้งาน 
</Text>
        <Text style={{fontFamily:'noto'}}>          2. ฮอร์โมนเครียดสั่งการโดยเพิ่มการเคลื่อนตัวของไขมันไตรกลีเซอไรด์ ให้ไปสะสมในเซลล์ไขมันมากขึ้น เร่งการเจริญเติบโตของเซลล์ไขมัน เกิดการกระจายตัวของไขมัน พบว่า ภาวะเครียดเรื้อรังส่งผลให้มีการสะสมของไขมันในช่องท้องมากขึ้น (Visceral Fat) ผู้ที่มีความเครียดเรื้อรัง จึงเสี่ยงต่อการอ้วนลงพุง ซึ่งนำไปสู่ความเสี่ยงต่อโรคเบาหวานและโรคหลอดเลือดหัวใจ
</Text>
<Text style={{fontFamily:'notos',paddingTop:10}}>การพักผ่อน</Text>
        <Text style={{fontFamily:'noto'}}>          1. การนอนหลับส่งผลต่อน้ำหนักตัว คือ การนอนหลับที่ไม่เพียงพอคือปัจจัยหลักที่ทำให้เป็นโรคอ้วนมีงานวิจัยที่พบว่าการนอนหลับไม่เพียงพออาจส่งผลให้ค่าดัชนีมวลกายและน้ำหนักตัวสูงมากกว่าเทียบกับผู้ที่นอนหลับพักผ่อนอย่างเพียงพองานวิจัยนั้นได้ทำการสำรวจดูความเปลี่ยนแปลงของน้ำหนักตัว ในผู้ที่นอนน้อยกว่า 7  ชั่วโมงต่อคืนพบว่าการนอนหลับไม่เพียงพอนั้น อาจเพิ่มโอกาสในการเป็นโรคอ้วนได้มากถึง 89% ในเด็ก และ 55% ในผู้ใหญ่ อีกหนึ่งงานวิจัยนั้นได้ทำสำรวจติดตามผลในพยาบาลที่ไม่ได้เป็นโรคอ้วนกว่า 60,000 ราย เป็นเวลา 16 ปี พบว่า พยาบาลที่ได้นอนน้อยกว่าคืนละ 5 ชั่วโมง จะมีโอกาสมากกว่า 15% ที่จะเป็นโรคอ้วน เทียบกับผู้ที่นอนหลับมากกว่า 7 ชั่วโมงต่อคืน ยิ่งโดยเฉพาะผู้ที่มีปัญหาเกี่ยวกับการนอนหลับ เช่น เป็นโรคหยุดหายใจขณะหลับ (Sleep apnea) จะยิ่งมีโอกาสที่จะมีน้ำหนักตัวเพิ่มขึ้น
</Text>
        <Text style={{fontFamily:'noto'}}>          2. หากนอนหลับ จะเกิดการหยุดกินอาหาร หลักการคิดง่ายๆ คือ คนเราไม่สามารถกินอาหาร ขณะที่กำลังนอนหลับอยู่ได้ ฉะนั้นหากนอนเยอะ จะลดโอกาสในการกินมากเกินความจำเป็น โดยเฉพาะมื้อดึกที่เป็นอันตรายต่อการเพิ่มของน้ำหนักตัว
</Text>
        <Text style={{fontFamily:'noto'}}>          3. การนอนไม่เพียงพอ จะทำให้เกิดความหิวบ่อยขึ้น มีงานวิจัยหลายชิ้นที่พบว่า ผู้ที่นอนหลับพักผ่อนไม่เพียงพอ มักจะมีความอยากอาหารมากขึ้น และหิวได้บ่อยขึ้น  เนื่องจากเมื่อขาดการนอนหลับ ร่างกายของจะผลิตฮอร์โมนเกรลิน (Ghrelin) ซึ่งเป็นฮอร์โมนที่ส่งสัญญาณความหิวไปยังสมองเพิ่มมากขึ้น ในขณะเดียวกัน ฮอร์โมนเลปติน (Leptin) ฮอร์โมนที่ช่วยกดความรู้สึกหิวและทำให้รู้สึกอิ่มจะผลิตออกมาน้อยลงจึงส่งผลให้รู้สึกหิวมากขึ้นและหิวบ่อยขึ้นนอกจากนี้ ร่างกายก็จะผลิตฮอร์โมนคอร์ติซอล (Cortisol)  ออกมามากขึ้นหากนอนหลับไม่เพียงพอฮอร์โมนความเครียดตัวนี้ก็เป็นอีกหนึ่งตัวการสำคัญที่ทำให้เกิดรู้สึกอยากอาหาร และพยายามหาอาหารมากินมากขึ้น ทำให้น้ำหนักตัวเพิ่มมากขึ้นเทียบกับผู้ที่ได้นอนหลับพักผ่อนอย่างเพียงพอ
</Text>
        <Text style={{fontFamily:'noto'}}>          4.การนอนไม่เพียงพอ อาจส่งผลกระทบต่อการเผาผลาญพลังงาน 
มีงานวิจัยที่พบว่าการนอนไม่พออาจส่งผลกระทบต่ออัตราการเผาผลาญพลังงานของร่างกาย งานวิจัยนั้นได้ทำการทดลองกับผู้ชาย 15 คน โดยไม่ให้นอนหลับเป็นเวลา 24 ชั่วโมงเต็ม พบว่าอัตราการเผาผลาญพลังงานลดลงไป 5% จากปกติ และอัตราการเผาผลาญพลังงาน
ก็ลดลงไปอีก 20% และเมื่อร่างกายเผาผลาญพลังงานได้น้อยลง ก็จะทำให้เกิดการสะสมแคลอรี่ไว้มากขึ้น ทำให้น้ำหนักตัวเพิ่มมากขึ้น
</Text>
        <Text style={{fontFamily:'noto'}}>          5. เพราะการนอนที่เพียงพอ ทำให้เพิ่มแรงออกกำลังกายมากขึ้น การนอนหลับพักผ่อนอย่างเพียงพอ จะทำให้เกิดความรู้สึกกระฉับกระเฉง มีเรี่ยวแรงในการทำกิจกรรมต่างๆ โดยเฉพาะการออกกำลังกาย ซึ่งเป็นหนึ่งในวิธีที่ดีที่สุดในการลดน้ำหนักอย่างมีประสิทธิภาพ การนอนหลับไม่เพียงพอนั้นนอกจากจะทำให้เรารู้สึกเหนื่อยล้า ไม่กระฉับกระเฉง รู้สึกไม่อยากทำอะไรแล้ว ยังอาจจะทำให้เรารู้สึกเหนื่อยจากการออกกำลังกายมากขึ้น และเมื่อเรารู้สึกเหนื่อย เราก็จะออกกำลังกายน้อยลง หรือไม่ยอมออกกำลังกาย ส่งผลให้ไม่สามารถควบคุมน้ำหนักได้อย่างมีประสิทธิภาพ และอาจทำให้น้ำหนักตัวเพิ่มได้
</Text>
        <Text style={{fontFamily:'noto',paddingTop:15}}>          ด้วยเหตุผลที่ว่ามาเหล่านี้ จึงทำให้การนอนหลับ มีส่วนสำคัญสำหรับการลดน้ำหนักอย่างมีประสิทธิภาพ ผู้ที่ต้องการจะลดน้ำหนักอย่างได้ผล ไม่ควรละเลยการนอนหลับพักผ่อน ในขณะเดียวกันผู้ที่ชื่นชอบการนอนและอยากลดน้ำหนัก ก็อย่าลืมการควบคุมอาหาร และการออกกำลังกายควบคู่กันไปด้วยเช่นกัน เพื่อให้การลดน้ำหนักนั้น เป็นไปได้อย่างมีประสิทธิภาพสูงสุด</Text>

        </View>
        </ScrollView>
    </View>
  )
}

const styles = StyleSheet.create({})