import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'
import { Table, TableWrapper, Row, Rows, Col } from 'react-native-table-component';

const CONTENT = {
    tableHead: ['ประเภทอาหาร', 'ปริมาณ','ปริมาณโปรตีน'],
    tableData: [
      ['เนื้อไก่', '100 กรัม','23 กรัม'],
      ['เนื้อวัว', '100 กรัม','22 กรัม'],
      ['เนื้อปลา', '100 กรัม','13 กรัม'],
      ['ไข่ไก่', '1 ฟอง','7 กรัม'],
      ['นมวัว', '100 กรัม','8 กรัม'],
      ['น้ำเต้าหู้เหลือง', '100 กรัม','36 กรัม'],
      ['จำพวกถั่วลิสง', '100 กรัม','24 กรัม'],
      ['แอลมอนต์', '100 กรัม','22 กรัม'],
      
    ],
  };

export default function M1({navigation}) {
  return (
    <View style={{flex:1}}>
    <ScrollView>
      <View style={{paddingHorizontal:15,paddingTop:15}}>
        <Text style={{fontFamily:'notos'}}>หมู่ที่ 1 ประเภทโปรตีน คือสารอาหารจำพวกเนื้อ สัตว์ นม ไข่ </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>         โปรตีน จะพบได้ในสารอาหารจำพวก เนื้อสัตว์ ไข่ ถั่วและนม เช่น เนื้อหมู เนื้อไก่ เนื้อวัว เนื้อปลา เครื่องในสัตว์ต่างๆ ไข่ไก่ เป็นต้น โดยประโยชน์ที่ได้จากสารอาหารจำพวกโปรตีน คือ เสริมสร้างความแข็งแรง ป้องกันไม่เกิดอาการเจ็บป่วย ซ่อมแซมส่วนที่สึกหรอ เสริมสร้างเซลล์ละเนื้อเยื่อ ควบคุมการทำงานของระบบทางเดินหายใจ ระบบย่อยอาหาร และระบบการดูดซึมของร่างกาย ร่างกายคนเราควรทานโปรตีนประมาณ 0.8 หรือ 1 กรัมต่อน้ำหนักตัว 1 กิโลกรัม แต่ส่วนใหญ่คนเรา โดยเฉพาะช่วงวัยเติบโตหรือวัยรุ่น จะเลือกรับประทานเนื้อสัตว์เป็นส่วนใหญ่ จะเห็นว่าเนื้อสัตว์ที่เราเลือกรับประทานในทุกวันล้วนมีสารอาหารที่แตกต่างกัน รวมถึงปริมาณสารอาหารที่ไม่เท่ากัน บางชนิดมีไขมันเยอะเกินไป บางชนิดอาจมีโปรตีนสูง ดังนั้นเราควรเลือกเนื้อสัตว์ประเภทใด เพื่อให้ตรงตามความต้องการสารอาหารในร่างกาย</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>1.<Text style={{fontFamily:'notos'}}>เนื้อหมู</Text> – เป็นเนื้อสัตว์ที่คนไทยนิยมทานมาก และยังเป็นแหล่งโปรตีนที่สำคัญมากๆ โดยเฉพาะส่วนที่เป็น “เนื้อสันใน” เป็นเนื้อส่วนที่มีมันแทรกน้อยที่สุด จึงมีปริมาณไขมันน้อย ให้โปรตีนสูง และยังมีวิตามินบี 1, วิตามินเอ, ฟอสฟอรัส และไนอาซีน เหมาะกับทุกสภาพร่างกาย แต่ถ้าเป็น “เนื้อสันนอก” หรือเนื้อส่วนอื่นๆ จะมีปริมาณไขมันมากกว่าสันในหลายเท่า จึงไม่เหมาะกับผู้ที่กำลังควบคุมน้ำหนัก หรือผู้ที่ป่วยเป็นโรคอ้วน หรือโรคที่เกี่ยวข้องกับไขมันครับ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>2.<Text style={{fontFamily:'notos'}}>เนื้อไก่</Text> – จัดเป็นแหล่งโปรตีนที่ดีมาก มีไขมันน้อย (ถ้าไม่ทานส่วนหนัง) ส่วนของเนื้อไก่ที่ดีที่สุดคือ “เนื้อส่วนอก” เป็นเนื้อที่มีสารอาหารประเภทโปรตีนสูงมาก และมีไขมันเพียงร้อยละ 8.2 เท่านั้น เหมาะกับผู้ที่ต้องการเสริมสร้างกล้ามเนื้อในร่างกาย ผู้ที่ต้องการลดไขมันในร่างกาย และส่วนที่ไม่ควรรับประทานคือ “เนื้อส่วนคอ” เนื่องจากมีผลการวิจัยออกมาว่าเป็นบริเวณที่พบสารตกค้างมากที่สุด แต่ทั้งนี้ทั้งนั้นไก่ ไม่เหมาะกับผู้ที่ป่วยเป็นโรคเก๊าท์ โดยเฉพาะบริเวณปีก หรือเอ็นข้อต่างๆ จะมีกรดยูริคอยู่สูงมากครับ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>3.<Text style={{fontFamily:'notos'}}>เนื้อปลา</Text> – เนื้อสัตว์ที่ขึ้นชื่อว่า Healthy ที่สุด มีโปรตีนคุณภาพชนิดที่ย่อยง่าย มีไขมันดีที่เรียกว่า “โอเมก้า 3” อยู่สูงมาก และยังมีวิตามินแร่ธาตุที่สำคัญต่อร่างกายอีกหลากหลายชนิด เป็นเนื้อสัตว์ที่เหมาะกับทุกเพศทุกวัย แต่ควรเลือกทานปลาที่สด สะอาด ถูกสุขอนามัยครับ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>4.<Text style={{fontFamily:'notos'}}>เนื้อวัว</Text> – เนื้อวัวมีหลายสัดส่วนให้เลือกทาน โดยความอร่อยและความนุ่มก็แตกต่างกันออกไป เนื้อวัวส่วนมากจะมีโปรตีนร้อยละ 20 ของน้ำหนักทั้งหมด และจะมีไขมันแทรกอยู่มาก โดยเฉพาะเนื้อวัวโคขุน หรือเนื้อวัวที่มีลักษณะเป็นลายหินอ่อนสวยๆ ที่คนนิยมทานกัน เนื้อวัวไม่เหมาะกับเด็ก ผู้สูงอายุ หรือผู้ที่มีปัญหาเกี่ยวกับระบบย่อยอาหาร เพราะเนื้อวัวจะย่อยยากกว่าเนื้อสัตว์ชนิดอื่น อาจทำให้เกิดอาการท้องอืดได้ครับ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>5.<Text style={{fontFamily:'notos'}}>เนื้อเป็ด</Text> – เป็ดเป็นสัตว์ประเภทเดียวกับไก่ แต่มีปริมาณสารอาหารที่แตกต่างกันพอสมควร มีไขมันมากกว่าไก่ แต่มีปริมาณโปรตีนน้อยกว่า จึงไม่เหมาะกับผู้ป่วยเป็นโรคที่เกี่ยวกับไขมัน หรือผู้ที่ต้องการควบคุมน้ำหนัก แต่ข้อดีของเนื้อเป็ด คือมีไนอาซิน หรือวิตามินบี 3 อยู่สูงมาก ซึ่งสารอาหารชนิดนี้จะช่วยบำรุงร่างกาย ทั้งระบบทางเดินโลหิต และยังช่วยลดระดับคอเลสเตอรอลในร่างกายได้อีกด้วยครับ ดังนั้น ปริมาณโปรตีนที่ควรได้รับ คือ 0.8  x 50 = 40 กรัมต่อวัน และเพื่อให้มีไอเดียว่าอาหารแต่ละอย่างมีปริมาณโปรตีนแค่ไหน ลองดูตัวอย่างจากตารางด้านล่างนี้</Text>
        <Table borderStyle={{ borderWidth: 1 }}>
        <Row
          data={CONTENT.tableHead}
          flexArr={[ 1.3, 1]}
          style={styles.head}
          textStyle={styles.text}
        />
        <TableWrapper style={styles.wrapper}>
          
          <Rows
            data={CONTENT.tableData}
            flexArr={[ 1.3, ,1]}
            style={styles.row}
            textStyle={{paddingLeft:10,fontFamily:'noto'}}
          />
        </TableWrapper>
      </Table>
      <View style={{padding:10}} />
        </View>
        </ScrollView>
        </View>
  )
}

const styles = StyleSheet.create({
    container: { flex: 1, backgroundColor: '#fff' },
   // head: { height: 40,  },
    //wrapper: { flexDirection: 'row' },
    row: {  },
    text: { textAlign: 'center',fontFamily:'noto' },
  });