import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

export default function M2({navigation}) {
  return (
    <View style={{flex:1}}>
    <ScrollView>
      <View style={{paddingHorizontal:15,paddingTop:15}}>
        <Text style={{fontFamily:'notos'}}>หมู่ที่ 2 ประเภทคาร์โบไฮเดรต คือสารอาหารจำพวกข้าว แป้ง น้ำตาล</Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>คาร์โบไฮเดรตที่มีคุณภาพสูงคืออะไร</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>คาร์โบไฮเดรตมีอยู่ในอาหารเกือบทุกชนิด แต่สามรถจำแนกแบ่งออกได้เป็นสองประเภทใหญ่ๆ คือ</Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>1.คาร์โบไฮเดรตชนิดดีหรือคาร์โบไฮเดรตเชิงซ้อน</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>คือ คาร์โบไฮเดรตหรืออาหารประเภทแป้งที่ไม่ผ่านกระบวนการ หรือแทบไม่ผ่านกรรมวิธีดัดแปลงใด ๆ มาเลย เช่น ข้าวและแป้งไม่ขัดสี, ถั่ว, ธัญพืช, ผักใบเขียว, พืชที่มีฝัก, มัน, โฮลวีท, โฮลเกรน ฯลฯ</Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>2.คาร์โบไฮเดรตชนิดไม่ดีหรือคาร์โบไฮเดรตเชิงเดี่ยว</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>คือ คาร์โบไฮเดรตที่ผ่านกระบวนการต่างๆ เพื่อให้มีรสชาติที่อร่อยขึ้น กินง่ายขึ้น เช่น แป้งขัดสีทุกชนิด, ข้าวขาว, ขนมปังขาว, แพนเค้ก, ขนมเค้ก, พาสต้า, ของหวาน, น้ำหวาน, ลูกอม, ขนมขบเคี้ยว, น้ำอัดลม ฯลฯ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>คาร์โบไฮเดรตที่ดีหรือคาร์โบไฮเดรตเชิงซ้อน คือ คาร์โบไฮเดรตที่ไม่ผ่านกรรมวิธีหรือการขัดสี อาทิ ข้าวกล้อง, ข้าวโอ๊ต, ธัญพืชต่างๆ , เผือก, มันเทศ หรือแม้แต่ผักผลไม้บางชนิดก็มีคาร์โบไฮเดรตเช่นเดียวกัน </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>มาดูคาร์โบไฮเดรตที่เหมาะกับคนที่ต้องการลดความอ้วนว่ามีอะไรบ้าง </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>1. ข้าวโอ๊ต </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>ในข้าวโอ๊ตมีเส้นใยในปริมาณมาก ซึ่งประโยชน์นั้นมีส่วนช่วยป้องกันโรคหัวใจ ,ลดคอเลสเตอรอล เหมาะกับผู้ที่ต้องการลดและควบคุมน้ำหนักอย่างยิ่ง </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 66 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>2.ข้าวกล้อง</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>ข้าวกล้องเป็นข้าวไม่ขัดสี ซึ่งอุดมไปด้วยวิตามินและแร่ธาตุต่างๆ อาทิ คาร์โบไฮเดรต, โปรตีน,ฟอสฟลอรัส, แมกนีเซียม, แคลเซียม, ธาตุเหล็ก, วิตามินบี 1, วิตามินบี 2, วิตามินบี ซึ่งประโยชน์ของข้าวกล้องมีมากมาย อาทิ ช่วยในเรื่องการขับถ่ายเนื่องจากในข้าวกล้องอุดมไปด้วยกากอาหาร, ป้องกันมะเร็งลำไส้, ช่วยป้องกันโรคเหน็บชาเพราะมีวิตามินบี 1, บำรุงสมอง ที่สำคัญช่วยในการเผาผลาญ อิ่มนานและควบคุมไขมันและน้ำตาลในเลือดอีกด้วย </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 23 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>3.มันเทศ </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>มันเทศจัดเป็นคาร์โบไฮเดรตอีกหนึ่งชนิดที่ดีต่อผู้ที่ลดน้ำหนักเนื่องจากมีไฟเบอร์สูงและยังทำให้อิ่มนาน นอกจากนี้แล้วมันเทศยังช่วยลดไขมันในเลือดได้อีกด้วย </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 25 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>4.ถั่วแดง </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>เป็นอาหารที่ผู้ลดน้ำหนักไม่ควรพลาด ซึ่งถั่วแดงอุดมไปด้วยวิตามินและแร่ธาตุต่างๆ อาทิ คาร์โบไฮเดรต, โปรตีน, เส้นใย, แคลเซียม, ธาตุเหล็ก, วิตามินบี, วิตามินอี, วิตามินซี ฯลฯ อีกทั้งยังมีประโยชน์มากมายไม่ว่าจะช่วยลดน้ำหนัก, ควบคุมคอเลสเตอรอล, ช่วยในเรื่องระบบเผาผลาญ และประโยชน์อื่นๆ </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 61 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>5.ฟักทอง </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>ฟักทองเหมาะกับผู้ที่ดูแลสุขภาพอย่างมาก เพราะมีกากใยสูงมาก แถมแคลอรี่ยังต่ำมากอีกด้วย </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 6.5 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>6.กล้วย </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>ผลไม้หาง่ายรสชาติอร่อยแถมยังมีวิตามินและแร่ธาตุที่ดีต่อร่างกายมากมาย ที่สำคัญคนที่ลดน้ำหนักสามารถรับประทานกล้วยได้เพราะในกล้วยนั้นจะมีวิตามินบี 1 และบี 2 ที่ช่วยในการเร่งเผาผลาญ น้ำตาลและไขมันแถมยังลดความอยากอาหารได้อีกด้วย </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 23 กรัม  </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}>7.แตงโม </Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>ผลไม้แคลอรี่ต่ำ รับประทานแล้วสดชื่น ซึ่งแตงโมเป็นผลไม้ที่มีส่วนช่วยในการลดและควบคุมน้ำหนักได้เนื่องจากมีแคลอรี่ต่ำเพียง 30 แคลอรี่ต่อปริมาณ 100 กรัมเท่านั้นเอง </Text>
        <Text style={{fontFamily:'notos',paddingTop:5}}> ปริมาณคาร์โบไฮเดรต : ปริมาณ 100 กรัม ให้คาร์โบไฮเดรต 8 กรัม</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>         จากการศึกษาตารางโภชนาการอาหารเปรียบเทียบแคลอรี่ของกรมอนามัย กระทรวงสาธารณสุข เผยว่า อาหารแต่ละชนิดที่ปริมาณ100 กรัมเท่ากัน  ข้าวให้พลังงาน 133 กิโลแคลอรี่ ในขณะอาหารประเภทคาร์โบไฮเดรตแบบเดียวกัน เช่น ขนมปังให้พลังงาน 267 กิโลแคลอรี่ , เส้นบะหมี่กึ่งสำเร็จรูป ให้พลังงาน 400 กิโลแคลอรี่ , ก๋วยเตี๋ยวเส้นใหญ่ ให้พลังงาน 160 กิโลแคลอรี่ ซึ่งล้วนให้พลังงานสูงกว่าการกินข้าวทั้งสิ้นหรือแม้กระทั่งอาหารคลีนที่นิยมรับประทานกันก็มีแคลอรี่สูงกว่าข้าวอีกด้วยจะเห็นได้ว่าการกินข้าวไม่ได้ทำให้อ้วนอย่างที่คิดแต่สาเหตุที่ทำให้อ้วนนั้นเป็นเพราะว่ามีการใช้พลังงานน้อยกว่าสิ่งที่กินเข้าไปในแต่ละวัน ในขณะเดียวกันคนที่เข้าใจผิดว่ากินข้าวแล้วอ้วนนั้นบางคนเลือกที่จะไม่กินข้าว หรือแม้กระทั่งอาหารจำพวกแป้งอื่นๆ เลย ซึ่งถือว่าเป็นเรื่องที่ผิดไม่ดีต่อสุขภาพเป็นอย่างมากเพราะ เมื่อไม่กินข้าวร่างกายจะขาดสารอาหารประเภทคาร์โบไฮเดรต ขาดวิตามินบีทำให้การเผาผลาญช้าลง ขาดพลังงานจนอ่อนเพลีย วิงเวียนศีรษะ หน้ามืด กินอาหารก็ไม่อยู่ท้อง ทำให้อยากกินจุกจิกตลอดเวลา และเป็นสาเหตุที่ทำให้การควบคุมน้ำหนักยากมากขึ้นไปกว่าเดิม</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>นอกจากนี้ ประโยชน์ของอาหารคาร์โบไฮเดรต จะให้พลังงานกับร่างกาย คือน้ำตาลและแป้งที่เรารับประทานจะเปลี่ยนเป็นน้ำตาลในเลือด (Blood sugar) ซึ่งอินซูลินจะนำน้ำตาลเข้าสู่เซลล์เพื่อเป็นพลังงาน น้ำตาลที่เหลือจาการเผาผลาญจะเก็บที่ตับและกล้ามเนื้อ ดังนั้นการบริโภคจำพวกประเภทคาร์โบไฮเดรต</Text>

    </View>
    </ScrollView>
    </View>
  )
}

const styles = StyleSheet.create({})