import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

export default function M3({navigation}) {
  return (
    <View style={{flex:1}}>
    <ScrollView>
      <View style={{paddingHorizontal:15,paddingTop:15}}>
        <Text style={{fontFamily:'notos'}}>หมู่ที่ 3 ประเภทเกลือแร่หรือแร่ธาตุ คือสารอาหารจำพวกพืช ผักชนิดต่างๆ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}><Text style={{fontFamily:'notos'}}>อาหารหลักหมู่ที่ 3 </Text>เป็นอาหารประเภทผักสดสีเขียว สีเหลืองและผักชนิดต่างๆ ผักสดชนิดต่างๆที่หาบริโภคในชีวิตประจำได้ง่าย มีทั้ง ชนิดใบ ดอก ผล ต้นและหัว เป็นต้น เช่น ถั่วฝักยาว ผักบุ้ง ตำลึง แตงกวา มะเขือ บวบ ฟักเขียว ผักกาด ฯลฯ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>          สารอาหารที่ได้จากอาหารหมู่นี้ก็คือ พวก เกลือแร่ เช่น แคลเซียม เหล็ก ฯลฯ และวิตามิน เช่น วิตามินซี วิตามินเอ วิตามินบีหนึ่ง วิตามินบีสอง ฯลฯ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>         ผักสีเขียวและผักสีเหลือง เช่น ฟักทอง มันเทศสีเหลือง เพราะผักเหล่านี้มีคุณค่าทางอาหารสูงเพราะอุดมไปด้วยวิตามินเอ และซี และที่สำคัญเกลือแร่  ก็เป็นส่วนประกอบหลักของอาหารหมู่ที่ 3 ที่จะประกอบไปด้วยพืช ผัก ชนิดต่าง ๆ ทั้งผักใบเขียวและผักใบสีต่าง ๆ เช่น สีเหลือง สีขาว สีม่วง สีแดง ฯลฯ ซึ่งจะให้คุณค่าทางอาหารที่แตกต่างกันออกไป โดยเกลือแร่เป็นกลุ่มของสารอนินทรีย์ ที่ร่างกายขาดไม่ได้ และมีการแบ่งเกลือแร่ที่คนเราต้องการออกเป็น 2 ประเภท คือ เกลือแร่ที่คนต้องการในขนาดมากกว่าวันละ 100 มิลลิกรัม (แคลเซียม ฟอสฟอรัส โซเดียม โพแทสเซียม แมกนีเซียม กำมะถัน คลอรีน) และเกลือแร่ที่คนเราต้องการในขนาดเพียงวันละ 2-3 มิลลิกรัม (ธาตุเหล็ก ทองแดง โคบอลต์ โครเมียม ซีลีเนียม ฟลูออรีน แมงกานีส สังกะสี ไอโอดีน โมลิบดีนัม) ประโยชน์ของเกลือแร่ มีดังนี้</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>1.	ช่วยเสริมสร้างภูมิต้านทานเชื้อโรคต่าง ๆ ทำให้ร่างกายมีความแข็งแรง</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>2.	ช่วยเสริมสร้างความแข็งแรงของกล้ามเนื้อ ฟัน และช่วยทำให้ผิวพรรณสดใส</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>3.	ช่วยทำให้อวัยวะต่าง ๆ ภายในร่างกายทำงานได้อย่างเป็นปกติ</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>4.	เกลือแร่เป็นส่วนประกอบของเนื้อเยื่อต่าง ๆ ในร่างกาย เช่น แคลเซียม ฟอสฟอรัส แมกนีเซียม เป็นส่วนประกอบที่สำคัญของกระดูกและฟัน ทำให้กระดูกและฟันแข็งแรง</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>5.	เกลือแร่เป็นส่วนประกอบของโปรตีน ฮอร์โมน และเอนไซม์ต่าง ๆ เช่น ธาตุเหล็กเป็นส่วนประกอบของโปรตีน Hemoglobin และทองแดงเป็นส่วนประกอบของเอนไซม์ซึ่งจำเป็นต่อการหายใจของเซลล์ ส่วนไอโอดีนเป็นส่วนประกอบของฮอร์โมนไทรอกซีน เป็นต้น</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>6.	ปฏิกิริยาหลายชนิดในร่างกายจะดำเนินไปได้ต้องมีเกลือแร่เป็นตัวเร่ง เช่น แมกนีเซียม เป็นตัวเร่งปฏิกิริยาที่เกี่ยวกับการเผาผลาญกลูโคสให้เกิดกำลังงาน</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>7.	ช่วยควบคุมความเป็นกรดด่างในร่างกาย โดยมีโซเดียม โพแทสเซียม ฟอสฟอรัส และคลอรีน ทำหน้าที่สำคัญในการควบคุมความเป็นกรดด่างในร่างกาย เพื่อให้มีชีวิตอยู่ได้</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>8.	ช่วยควบคุมน้ำ โซเดียม และโพแทสเซียม ช่วยในการควบคุมความสมดุลของน้ำภายในและภายนอกเซลล์</Text>
        <Text style={{fontFamily:'noto',paddingTop:5}}>9.	อาหารในหมู่นี้จะมีเส้นใยอาหารมาก การรับประทานเป็นประจำ จะช่วยทำให้ลำไส้ทำงานได้อย่างเป็นปกติ ทำให้ขับถ่ายได้ง่าย</Text>
      </View>
</ScrollView>
</View>
  )
}

const styles = StyleSheet.create({})